-- SQLite
.mode csv
.import users.csv users

-- 나이평군
SELECT AVG(age) FROM users WHERE age>=30;
'''
35.1763285024155
'''

-- 잔액
SELECT first_name, max(balance) FROM users;
'''
"순옥",1000000
'''

-- 나이 30이상 계좌 평균잔액
SELECT avg(balance) FROM users WHERE age>=30;
'''
153541.425120773
'''

--- user테이블에 나이가 20대인 사람
SELECT * FROM users WHERE age LIKE'2_';
'''
"선영","박",25,"경상북도",011-1464-5412,530
"춘자","고",24,"충청남도",010-6400-6730,800
"준영","이",21,"충청북도",02-2685-2468,200 ....
'''

---지역번호가 02인사람
SELECT * FROM users WHERE phone LIKE '02-%';

'''
"정남","박",17,"충청남도",02-1230-2269,89000
"광수","장",18,"제주특별자치도",02-4566-1764,930000
"준영","이",21,"충청북도",02-2685-2468,200 ...
'''

--- 이름이 준으로 끝나는 사람
SELECT * FROM users WHERE first_name LIKE '%준';
'''
"민준","한",25,"충청북도",011-6639-9833,15000
"민준","오",26,"제주특별자치도",010-4369-9882,2700 ....
'''

--- 중간번호가 5114인 사람
SELECT * FROM users WHERE phone LIKE '%-5114-%';
'''
"현준","황",37,"충청북도",011-5114-9343,220
'''

--- 나이 오름차순으로 정렬후 상위 10개만 조회
SELECT * FROM users ORDER BY age ASC LIMIT 10;
'''
"서영","김",15,"제주특별자치도",016-3046-9822,640000
"지후","엄",15,"경상북도",02-6714-5416,16000
"우진","고",15,"경상북도",011-3124-1126,300
"우진","한",15,"강원도",011-8068-4814,3300
"은영","이",15,"전라남도",010-5284-4904,78000
"지훈","김",15,"전라북도",02-9385-7954,760
"승현","장",15,"충청북도",016-5731-8009,450
"주원","김",15,"전라남도",02-4240-8648,6300
"은정","이",15,"경상북도",010-6099-6176,5900
"정수","강",15,"충청북도",02-7245-5623,500
'''

--- 나이 순, 성 순으로 오름차순 후 상위 10개조회
SELECT * FROM users ORDER BY age, last_name ASC LIMIT 10;
'''
"정수","강",15,"충청북도",02-7245-5623,500
"우진","고",15,"경상북도",011-3124-1126,300
"시우","고",15,"제주특별자치도",016-3732-8726,270
"현숙","곽",15,"충청남도",016-7423-1481,710000
"서영","김",15,"제주특별자치도",016-3046-9822,640000
"지훈","김",15,"전라북도",02-9385-7954,760
"주원","김",15,"전라남도",02-4240-8648,6300
"예준","김",15,"충청남도",02-9726-5034,76000
"예준","김",15,"충청북도",016-3898-3279,150000
"서영","김",15,"강원도",010-4016-6803,53000
'''

--- 계좌 잔액 내림차순 정렬하여 해당 유저의 성과 이름 10개 조회
SELECT last_name, first_name FROM users ORDER BY balance DESC LIMIT 10;
'''
"김","순옥"
"우","상철"
"민","진호"
"이","재호"
"강","민준"
"황","은정"
"김","영수"
"허","정남"
"김","선영"
"문","미영"
'''